app/services/create_task_service.rb

      task = Task.new(task_params)

      unless user.is_a?(ProjectManager)
        task.errors.add(:base, "can only be created by a Project Manager")
        return task
      end


      if ["working", "needs_review"].include?(task.status)
        task.errors.add(:base, "can only be set to this status by an Employee")
        return task
      end

      task.project_manager = user

      if task_params[:assigned_employee_ids].present?
        incoming_ids = task_params[:assigned_employee_ids].map(&:to_i)
        existing_employee_ids = Employee.where(id: incoming_ids).pluck(:id).sort

        if incoming_ids == existing_employee_ids
          ActiveRecord::Base.transaction do
            task.save

            unless task.errors.any?
              incoming_ids.each do |id|
                EmployeeTaskAssignment.create(task: task, employee_id: id)
---
SELECT "employees"."id" FROM "employees" WHERE "employees"."id" IN ($1, $2, $3)  [["id", 9], ["id", 10], ["id", 11]]
INSERT INTO "tasks" ("title", "description", "work_focus", "due_date", "status", "project_manager_id", "created_at", "updated_at", "parent_task_id", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "employee_task_assignments" ("employee_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["employee_id", 9], ["task_id", 13], ["created_at", "2023-05-30 19:57:48.020081"], ["updated_at", "2023-05-30 19:57:48.020081"]]

          return task
        end
      else
        task.save
---
INSERT INTO "tasks" ("title", "description", "work_focus", "due_date", "status", "project_manager_id", "created_at", "updated_at", "parent_task_id", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"