app/services/update_task_service.rb

UPDATE "tasks" SET "work_focus" = $1, "due_date" = $2, "updated_at" = $3, "parent_task_id" = $4, "project_id" = $5 WHERE "tasks"."id" = $6  [["work_focus", 0], ["due_date", "2023-06-05 23:21:36"], ["updated_at", "2023-05-30 20:55:04.095599"], ["parent_task_id", 5], ["project_id", 1], ["id", 3]]
---
    def handle_other_changes(task, user, task_params)
      params = task_params.except(:assigned_employee_ids, :status)
      task.update(params)

SELECT "employees"."id" FROM "employees" WHERE "employees"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "employees"."id" FROM "employees" INNER JOIN "employee_task_assignments" ON "employees"."id" = "employee_task_assignments"."employee_id" WHERE "employee_task_assignments"."task_id" = $1  [["task_id", 14]]
INSERT INTO "employee_task_assignments" ("employee_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["employee_id", 1], ["task_id", 11], ["created_at", "2023-05-30 20:38:02.818080"], ["updated_at", "2023-05-30 20:38:02.818080"]]
DELETE FROM "employee_task_assignments" WHERE "employee_task_assignments"."id" = $1  [["id", 19]]
SELECT "employee_task_assignments".* FROM "employee_task_assignments" WHERE "employee_task_assignments"."task_id" = $1 AND "employee_task_assignments"."employee_id" NOT IN ($2, $3, $4)  [["task_id", 14], ["employee_id", 1], ["employee_id", 2], ["employee_id", 3]]
---
    def handle_employee_assignment(task, user, task_params)
      return task unless task_params[:assigned_employee_ids].present?
      incoming_ids = task_params[:assigned_employee_ids].map(&:to_i).sort
      existing_employee_ids = Employee.where(id: incoming_ids).pluck(:id).sort
      already_assigned_ids = task.employees.pluck(:id)

      if incoming_ids != already_assigned_ids and !user.is_a?(ProjectManager)
        task.errors.add(:base, "can only have assignments updated by a project manager")
      elsif incoming_ids == existing_employee_ids
        ids_to_create = incoming_ids.difference(already_assigned_ids)
        ActiveRecord::Base.transaction do
          ids_to_create.each do |id|
            EmployeeTaskAssignment.create(task: task, employee_id: id)
          end
          task.employee_task_assignments.where.not(employee_id: incoming_ids).destroy_all