app/views/tasks/_task.html.slim

        b Subtasks:
      - @task.subtasks.each do |s|
---
SELECT "tasks".* FROM "tasks"