app/views/tasks/index.html.slim

          ul
            - task.subtasks.each do |st|
---
SELECT "tasks".* FROM "tasks"