app/views/projects/show.html.slim

  tbody
    - @project.tasks.each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 1]]