app/sidekiq/overdue_task_status_update_job.rb

  def perform(*args)
    Task.where("due_date < ?", Time.now).update_all(status: "late")
---
UPDATE "tasks" SET "status" = $1 WHERE (due_date > '2023-05-30 21:43:37.360771')  [["status", 4]]