app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN ($1, $2, $3, $4)  [["id", 5], ["id", 10], ["id", 2], ["id", 11]]
---
  def show
    @employee = Employee.includes(:tasks).find(params[:id])

INSERT INTO "employees" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "name", "title", "work_focus") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "updated_at" = $1, "name" = $2, "title" = $3, "work_focus" = $4 WHERE "employees"."id" = $5  [["updated_at", "2023-05-30 21:14:19.150630"], ["name", "Some Name"], ["title", "Some Title"], ["work_focus", 0], ["id", 13]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)