app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.includes(:tasks).all

INSERT INTO "projects" ("title", "description", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save