app/controllers/project_managers_controller.rb

SELECT "project_managers".* FROM "project_managers"
---
  def index
    @project_managers = ProjectManager.all

UPDATE "project_managers" SET "updated_at" = $1, "name" = $2 WHERE "project_managers"."id" = $3  [["updated_at", "2023-05-29 21:14:59.979238"], ["name", "Project1 Manager1 hello"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project_manager.update(project_manager_params)

DELETE FROM "project_managers" WHERE "project_managers"."id" = $1  [["id", 1]]
---
  def destroy
    @project_manager.destroy

SELECT "project_managers".* FROM "project_managers" WHERE "project_managers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_project_manager
      @project_manager = ProjectManager.find(params[:id])