app/controllers/tasks_controller.rb

  def index
    @tasks = Task.includes(:subtasks).all
---
SELECT "tasks".* FROM "tasks"

  def show
    @task = Task.includes(:employees).includes(:subtasks).find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" IN ($1, $2, $3)  [["id", 10], ["id", 7], ["id", 8]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]