app/models/task.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" != $1 AND "tasks"."parent_task_id" IS NULL  [["id", 15]]
---
  def valid_parent_options
    # you can't pick yourself as a parent
    # you can't pick any task which is already a sub-task (i.e. no sub-sub-tasks)
    self.class.where.not(id: self.id).where(parent_task_id: nil).map { |t| [t.title, t.id] }

SELECT "projects".* FROM "projects"
---
  def project_options
    Project.all.map{ |p| [p.title, p.id] }

SELECT "employees".* FROM "employees"
---
  def assigned_employee_ids_options
    Employee.all.map { |e| [e.name, e.id] }